Центр_управления_производительностью_демо/src/InformationRegisters/СостояниеСбораПоказателей/СостояниеСбораПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеСбораПоказателей</name>
  <resources>
    <name>ВключенСборСчетчиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Центр_управления_производительностью_демо/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <predefined>
    <items>
      <name>Наполнитель</name>
      <description>Наполнитель</description>
    </items>
  </predefined>
  <attributes>
    <name>COMКоннекторЗарегистрирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдминистраторКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияНастроек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБД</name>
    <comment>Имя базы данных на сервере СУБД</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИБ</name>
    <comment>Имя информационной базы в кластере</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяИБ</name>
    <comment>Основной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПП1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализВзаимоблокировок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализГранулярностиБлокировок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализЗапросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализОжиданий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализСерверныхВызовов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППОСВзаимоблокировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППОСТаймауты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПППроизвольныеСчетчикиОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогТрассировкиЛокальный</name>
    <comment>Локальный для сервера СУБД каталог трассировки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогТрассировкиСетевой</name>
    <comment>Сетевой каталог трассировки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВерсииСУБД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначенаРольProcessAdmin</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Настроено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольАдминистратораКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяИБ</name>
    <comment>Основной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьОтладочныеСообщения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортЦентральногоСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимУправленияБлокировкойДанных</name>
    <type>
      <types>EnumRef.РежимыУправленияБлокировкойДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверИБ</name>
    <comment>Кластер серверов 1С:Предприятия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверСУБД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособАутентификации</name>
    <type>
      <types>EnumRef.СпособыАутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОССервераСУБД</name>
    <type>
      <types>EnumRef.ТипыОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСУБД</name>
    <type>
      <types>EnumRef.ТипыСУБД</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьТрассировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИменаКаталоговТЖ</name>
    <attributes>
      <name>СерверКластера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Конфигурация</name>
      <comment>Полный путь файла logcfg.xml</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Локальный</name>
      <comment>Локальный для сервера 1С:Предприятия каталог технологического журнала</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сетевой</name>
      <comment>Сетевой каталог технологического журнала</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серверы</name>
    <attributes>
      <name>АгентЦКК</name>
      <type>
        <types>CatalogRef.АгентыЦКК</types>
      </type>
    </attributes>
    <attributes>
      <name>Сервер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособСбораСчетчиков</name>
      <type>
        <types>EnumRef.СпособыСбораСчетчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯзыкОС</name>
      <type>
        <types>CatalogRef.ЯзыкиОС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтатусыШагов</name>
    <attributes>
      <name>ИмяШага</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыШаговМастераНастройки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетчикиОС</name>
    <attributes>
      <name>НомерСтрокиСервера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Счетчик</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Центр_управления_производительностью_демо/src/InformationRegisters/СостояниеСбораПоказателей/ManagerModule.bsl
// Возвращает признак необходимости сбора счетчиков производительности
// агентом ЦКК
//
// Параметры:
//  ИнформационнаяБаза  - СправочникСсылка.ИнформационныеБазы - Информационная база
//
//  АгентЦКК  - СправочникСсылка.АгентыЦКК - Агент ЦКК
//
// Возвращаемое значение:
//  Булево - признак необходимости сбора счетчиков
// 
Функция ВключенСборСчетчиков(АгентЦКК) Экспорт
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(СостояниеИБ.ВключенСборСчетчиков) КАК ВключенСборСчетчиков,
	               |	МАКСИМУМ(СостояниеИБ.ТестСбораСчетчиков) КАК ТестСбораСчетчиков
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЕСТЬNULL(СостояниеСбораПоказателей.ВключенСборСчетчиков, ЛОЖЬ) КАК ВключенСборСчетчиков,
	               |		ЛОЖЬ КАК ТестСбораСчетчиков
	               |	ИЗ
	               |		Справочник.ИнформационныеБазы.Серверы КАК ИнформационныеБазыСерверы
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеСбораПоказателей КАК СостояниеСбораПоказателей
	               |			ПО ИнформационныеБазыСерверы.Ссылка = СостояниеСбораПоказателей.ИнформационнаяБаза
	               |	ГДЕ
	               |		ИнформационныеБазыСерверы.АгентЦКК = &АгентЦКК
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		АгентЦКК.ТестСбораСчетчиков,
	               |		АгентЦКК.ТестСбораСчетчиков
	               |	ИЗ
	               |		Справочник.АгентыЦКК КАК АгентЦКК
	               |	ГДЕ
	               |		АгентЦКК.Ссылка = &АгентЦКК) КАК СостояниеИБ";
	
	Запрос.УстановитьПараметр("АгентЦКК", АгентЦКК);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ВключенСборСчетчиков Тогда
			Если Не Выборка.ТестСбораСчетчиков Тогда
				СчетчикиАгента = Справочники.ИнформационныеБазы.ПолучитьСчетчикиАгента(АгентЦКК);
				Результат = (СчетчикиАгента.Количество() > 0);
			Иначе
				АгентЦККОбъект = АгентЦКК.ПолучитьОбъект();
				АгентЦККОбъект.ТестСбораСчетчиков = Ложь;
				АгентЦККОбъект.Записать();
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ВключенСборСчетчиков()

// Снимает или устанавливает признак необходимости сбора счетчиков
// производительности Агентом ЦКК
//
// Параметры:
//  ИБ - СправочникСсылка.ИнформационныеБазы - Информационная база
//  ВключитьСбор  - Булево - Значение признака
//
Процедура ВключитьСборСчетчиков(ИБ, ВключитьСбор) Экспорт
	
	НаборЗаписей = РегистрыСведений.СостояниеСбораПоказателей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИнформационнаяБаза.Установить(ИБ);
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.ИнформационнаяБаза = ИБ;
	НоваяСтрока.ВключенСборСчетчиков = ВключитьСбор;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры // ВключитьСборСчетчиков()
